lkolbly/cmsis-svd/data/TexasInstruments/LM3S812.svd
        <register>
          <name>SSCTL0</name>
          <description>ADC Sample Sequence Control 0</description>
          <addressOffset>0x00000044</addressOffset>
          <fields>
            <field>
              <name>ADC_SSCTL0_D0</name>
              <description>1st Sample Diff Input Select</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END0</name>
              <description>1st Sample is End of Sequence</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE0</name>
              <description>1st Sample Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS0</name>
              <description>1st Sample Temp Sensor Select</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_D1</name>
              <description>2nd Sample Diff Input Select</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END1</name>
              <description>2nd Sample is End of Sequence</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE1</name>
              <description>2nd Sample Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS1</name>
              <description>2nd Sample Temp Sensor Select</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_D2</name>
              <description>3rd Sample Diff Input Select</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END2</name>
              <description>3rd Sample is End of Sequence</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE2</name>
              <description>3rd Sample Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS2</name>
              <description>3rd Sample Temp Sensor Select</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_D3</name>
              <description>4th Sample Diff Input Select</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END3</name>
              <description>4th Sample is End of Sequence</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE3</name>
              <description>4th Sample Interrupt Enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS3</name>
              <description>4th Sample Temp Sensor Select</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_D4</name>
              <description>5th Sample Diff Input Select</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END4</name>
              <description>5th Sample is End of Sequence</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE4</name>
              <description>5th Sample Interrupt Enable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS4</name>
              <description>5th Sample Temp Sensor Select</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_D5</name>
              <description>6th Sample Diff Input Select</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END5</name>
              <description>6th Sample is End of Sequence</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE5</name>
              <description>6th Sample Interrupt Enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS5</name>
              <description>6th Sample Temp Sensor Select</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_D6</name>
              <description>7th Sample Diff Input Select</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END6</name>
              <description>7th Sample is End of Sequence</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE6</name>
              <description>7th Sample Interrupt Enable</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS6</name>
              <description>7th Sample Temp Sensor Select</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_D7</name>
              <description>8th Sample Diff Input Select</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_END7</name>
              <description>8th Sample is End of Sequence</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_IE7</name>
              <description>8th Sample Interrupt Enable</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL0_TS7</name>
              <description>8th Sample Temp Sensor Select</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFIFO0</name>
          <description>ADC Sample Sequence Result FIFO 0</description>
          <addressOffset>0x00000048</addressOffset>
          <fields>
            <field>
              <name>ADC_SSFIFO0_DATA</name>
              <description>Conversion Result Data</description>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFSTAT0</name>
          <description>ADC Sample Sequence FIFO 0 Status</description>
          <addressOffset>0x0000004C</addressOffset>
          <fields>
            <field>
              <name>ADC_SSFSTAT0_TPTR</name>
              <description>FIFO Tail Pointer</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT0_HPTR</name>
              <description>FIFO Head Pointer</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT0_EMPTY</name>
              <description>FIFO Empty</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT0_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSMUX1</name>
          <description>ADC Sample Sequence Input Multiplexer Select 1</description>
          <addressOffset>0x00000060</addressOffset>
          <fields>
            <field>
              <name>ADC_SSMUX1_MUX0</name>
              <description>1st Sample Input Select</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX1_MUX1</name>
              <description>2nd Sample Input Select</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX1_MUX2</name>
              <description>3rd Sample Input Select</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX1_MUX3</name>
              <description>4th Sample Input Select</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSCTL1</name>
          <description>ADC Sample Sequence Control 1</description>
          <addressOffset>0x00000064</addressOffset>
          <fields>
            <field>
              <name>ADC_SSCTL1_D0</name>
              <description>1st Sample Diff Input Select</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_END0</name>
              <description>1st Sample is End of Sequence</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_IE0</name>
              <description>1st Sample Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_TS0</name>
              <description>1st Sample Temp Sensor Select</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_D1</name>
              <description>2nd Sample Diff Input Select</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_END1</name>
              <description>2nd Sample is End of Sequence</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_IE1</name>
              <description>2nd Sample Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_TS1</name>
              <description>2nd Sample Temp Sensor Select</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_D2</name>
              <description>3rd Sample Diff Input Select</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_END2</name>
              <description>3rd Sample is End of Sequence</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_IE2</name>
              <description>3rd Sample Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_TS2</name>
              <description>3rd Sample Temp Sensor Select</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_D3</name>
              <description>4th Sample Diff Input Select</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_END3</name>
              <description>4th Sample is End of Sequence</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_IE3</name>
              <description>4th Sample Interrupt Enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_TS3</name>
              <description>4th Sample Temp Sensor Select</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFIFO1</name>
          <description>ADC Sample Sequence Result FIFO 1</description>
          <addressOffset>0x00000068</addressOffset>
          <fields>
            <field>
              <name>ADC_SSFIFO1_DATA</name>
              <description>Conversion Result Data</description>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFSTAT1</name>
          <description>ADC Sample Sequence FIFO 1 Status</description>
          <addressOffset>0x0000006C</addressOffset>
          <fields>
            <field>
              <name>ADC_SSFSTAT1_TPTR</name>
              <description>FIFO Tail Pointer</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT1_HPTR</name>
              <description>FIFO Head Pointer</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT1_EMPTY</name>
              <description>FIFO Empty</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT1_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSMUX2</name>
          <description>ADC Sample Sequence Input Multiplexer Select 2</description>
          <addressOffset>0x00000080</addressOffset>
          <fields>
            <field>
              <name>ADC_SSMUX2_MUX0</name>
              <description>1st Sample Input Select</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX2_MUX1</name>
              <description>2nd Sample Input Select</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX2_MUX2</name>
              <description>3rd Sample Input Select</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX2_MUX3</name>
              <description>4th Sample Input Select</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSCTL2</name>
          <description>ADC Sample Sequence Control 2</description>
          <addressOffset>0x00000084</addressOffset>
          <fields>
            <field>
              <name>ADC_SSCTL2_D0</name>
              <description>1st Sample Diff Input Select</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_END0</name>
              <description>1st Sample is End of Sequence</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_IE0</name>
              <description>1st Sample Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_TS0</name>
              <description>1st Sample Temp Sensor Select</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_D1</name>
              <description>2nd Sample Diff Input Select</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_END1</name>
              <description>2nd Sample is End of Sequence</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_IE1</name>
              <description>2nd Sample Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_TS1</name>
              <description>2nd Sample Temp Sensor Select</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_D2</name>
              <description>3rd Sample Diff Input Select</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_END2</name>
              <description>3rd Sample is End of Sequence</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_IE2</name>
              <description>3rd Sample Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_TS2</name>
              <description>3rd Sample Temp Sensor Select</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_D3</name>
              <description>4th Sample Diff Input Select</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_END3</name>
              <description>4th Sample is End of Sequence</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_IE3</name>
              <description>4th Sample Interrupt Enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_TS3</name>
              <description>4th Sample Temp Sensor Select</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFIFO2</name>
          <description>ADC Sample Sequence Result FIFO 2</description>
          <addressOffset>0x00000088</addressOffset>
          <fields>
            <field>
              <name>ADC_SSFIFO2_DATA</name>
              <description>Conversion Result Data</description>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFSTAT2</name>
          <description>ADC Sample Sequence FIFO 2 Status</description>
          <addressOffset>0x0000008C</addressOffset>
          <fields>
            <field>
              <name>ADC_SSFSTAT2_TPTR</name>
              <description>FIFO Tail Pointer</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT2_HPTR</name>
              <description>FIFO Head Pointer</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT2_EMPTY</name>
              <description>FIFO Empty</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT2_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSMUX3</name>
          <description>ADC Sample Sequence Input Multiplexer Select 3</description>
          <addressOffset>0x000000A0</addressOffset>
          <fields>
            <field>
              <name>ADC_SSMUX3_MUX0</name>
              <description>1st Sample Input Select</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSCTL3</name>
          <description>ADC Sample Sequence Control 3</description>
          <addressOffset>0x000000A4</addressOffset>
          <fields>
            <field>
              <name>ADC_SSCTL3_D0</name>
              <description>1st Sample Diff Input Select</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL3_END0</name>
              <description>1st Sample is End of Sequence</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL3_IE0</name>
              <description>1st Sample Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL3_TS0</name>
              <description>1st Sample Temp Sensor Select</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFIFO3</name>
          <description>ADC Sample Sequence Result FIFO 3</description>
          <addressOffset>0x000000A8</addressOffset>
          <fields>
            <field>
              <name>ADC_SSFIFO3_DATA</name>
              <description>Conversion Result Data</description>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFSTAT3</name>
          <description>ADC Sample Sequence FIFO 3 Status</description>
          <addressOffset>0x000000AC</addressOffset>
          <fields>
            <field>
              <name>ADC_SSFSTAT3_TPTR</name>
              <description>FIFO Tail Pointer</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT3_HPTR</name>
              <description>FIFO Head Pointer</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT3_EMPTY</name>
              <description>FIFO Empty</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT3_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TMLB</name>
          <description>ADC Test Mode Loopback</description>
          <addressOffset>0x00000100</addressOffset>
          <fields>
            <field>
              <name>ADC_TMLB_LB</name>
              <description>Loopback Mode Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
